% 机动车刹车距离
clear; clc;

dl = 120;  % 某路段的有效视距，单位：米
time = 10;  % 驾驶员的平均反应时间，单位：秒
v = 20 : 10 : 150;  % 速度，插值节点，单位：千米/小时
vs = v * (1000 / 3600); % 速度，插值节点，单位：米/秒
d1 = 10 * vs; % 反应距离
d2=[3.15,7.08,12.59,19.68,28.34,38.57,50.4,63.75,...
    78.71,95.22,113.29,132.93,154.12,176.87];  % 制动距离，插值节点
d3 = 10;  % 安全距离
d = d1 + d2 + d3;  % 有效视距 = 反应距离 + 制动距离 + 安全距离
vi = 20 : 1 : 150;  % 速度，待插值点
di = interp1(v, d, vi, 'spline');  % 样条插值得到的有效视距
x = abs(di - dl);   % 有效视距差的绝对值
[y,i]=sort(x);    % 排序，i是排序后元素的序号
fprintf('有效视距%.4f米某路段的最高时速: %.4f\n',dl,vi(i(1)));
plot(vi,di,vi(i(1)),di(i(1)),'rp');

v_max = 125; % 最高限速，单位：千米/小时
i = find(vi - 125 == 0);
fprintf('最高时速%.4f千米/小时的路段需保证有效视距: %.4f\n', v_max, di(i));